Public Attributes | List of all members
API_OverrideRuleStyle Struct Reference
Graphic Overrides
Specifies what, and how an API_OverrideRule should override. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_OverriddenAttribute  | lineType
Specifies how the line type should be overridden.
API_OverriddenPen  | lineMarkerTextPen
Specifies how the line/marker/text pen should be overridden.
API_OverriddenAttribute  | fillOverride
Specifies how the fills should be overridden.
API_OverriddenFillType  | fillType
Specifies which fills should be overridden.
API_OverriddenPen  | fillForegroundPenOverride
Specifies how the fill foreground pen should be overridden.
API_OverriddenFillType  | fillTypeForegroundPen
API_OverriddenPenOrRGB  | fillBackgroundPenOverride
Specifies how the fill background pen should be overridden.
API_OverriddenFillType  | fillTypeBackgroundPen
API_OverriddenAttributeOrRGB  | surfaceOverride
Specifies how the surface should be overridden.
API_OverriddenSurfaceType  | surfaceType
Specifies which surface should be overridden.
bool  | showSkinSeparators
Specifies if the skin separators should be shown.
bool  | overridePenColorAndThickness
Specifies if the pen color and thickness should be overridden.
API_OverriddenSurfaceType  | hiddenContours
Specifies which contours should be hidden.
bool  | overrideContours
Specifies if contour hiding should be overridden.
Detailed Description
Specifies what, and how an API_OverrideRule should override.
Since
Archicad 25
Remarks
In version 25, the fillBackgroundPenOverride and surfaceOverride members type are changed to API_OverriddenAttributeOrRGB In version 25, hiddenContours and overrideContours are added
Member Data Documentation
◆ fillBackgroundPenOverride
 API_OverrideRuleStyle::fillBackgroundPenOverride
Specifies how the fill background pen should be overridden.
◆ fillForegroundPenOverride
 API_OverrideRuleStyle::fillForegroundPenOverride
Specifies how the fill foreground pen should be overridden.
◆ fillOverride
 API_OverrideRuleStyle::fillOverride
Specifies how the fills should be overridden.
◆ fillType
 API_OverrideRuleStyle::fillType
Specifies which fills should be overridden.
◆ fillTypeBackgroundPen
 API_OverriddenFillType API_OverrideRuleStyle::fillTypeBackgroundPen
◆ fillTypeForegroundPen
 API_OverriddenFillType API_OverrideRuleStyle::fillTypeForegroundPen
◆ hiddenContours
 API_OverrideRuleStyle::hiddenContours
Specifies which contours should be hidden.
◆ lineMarkerTextPen
 API_OverrideRuleStyle::lineMarkerTextPen
Specifies how the line/marker/text pen should be overridden.
◆ lineType
 API_OverrideRuleStyle::lineType
Specifies how the line type should be overridden.
◆ overrideContours
 API_OverrideRuleStyle::overrideContours
Specifies if contour hiding should be overridden.
◆ overridePenColorAndThickness
 API_OverrideRuleStyle::overridePenColorAndThickness
Specifies if the pen color and thickness should be overridden.
◆ showSkinSeparators
 API_OverrideRuleStyle::showSkinSeparators
Specifies if the skin separators should be shown.
◆ surfaceOverride
 API_OverrideRuleStyle::surfaceOverride
Specifies how the surface should be overridden.
◆ surfaceType
 API_OverrideRuleStyle::surfaceType
Specifies which surface should be overridden.